app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures"
---
  def index
  	@pic = Picture.all

INSERT INTO "pictures" ("content", "picture", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "ぐでたま"], ["picture", "gudetama2.jpg"], ["created_at", "2017-09-18 04:19:58.917109"], ["updated_at", "2017-09-18 04:19:58.917109"]]
---
  def create
  	 @pic = Picture.new(pictures_params)
  	if @pic.save

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", 9]]
---
  def edit
    @pic = Picture.find(params[:id])

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", 10]]
UPDATE "pictures" SET "picture" = $1, "updated_at" = $2 WHERE "pictures"."id" = $3  [["picture", "gudetama8.jpg"], ["updated_at", "2017-09-20 02:03:15.263191"], ["id", 10]]
---
  def update
    @pic = Picture.find(params[:id])
    @pic.update(pictures_params)

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", 2]]
---
   def set_picture
    @pic = Picture.find(params[:id])